; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_1 ?v8 - type_1 ?v3 - type_3)
 	      (pred_3 ?v4 - object ?v3 - type_3)
	      (pred_4 ?v8 - type_1 ?v6 - type_2)
	      (pred_2 ?v8 - type_1 ?v4 - object ?v6 - type_2))

   (:action op_2
       :parameters  (?v8 - type_1 ?v1 ?v5 - type_3)
       :precondition (and  (pred_1 ?v8 ?v1))
       :effect (and  (pred_1 ?v8 ?v5)
		     (not (pred_1 ?v8 ?v1))))

   (:action op_3
       :parameters (?v8 - type_1 ?v7 - object ?v2 - type_3 ?v6 - type_2)
       :precondition  (and  (pred_3 ?v7 ?v2) (pred_1 ?v8 ?v2) (pred_4 ?v8 ?v6))
       :effect (and (pred_2 ?v8 ?v7 ?v6)
		    (not (pred_3 ?v7 ?v2)) 
		    (not (pred_4 ?v8 ?v6))))

   (:action op_1
       :parameters (?v8 - type_1 ?v7 - object ?v2 - type_3 ?v6 - type_2)
       :precondition  (and  (pred_2 ?v8 ?v7 ?v6) (pred_1 ?v8 ?v2))
       :effect (and (pred_3 ?v7 ?v2)
		    (pred_4 ?v8 ?v6)
		    (not (pred_2 ?v8 ?v7 ?v6)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_07 - type_1
obj_03 obj_05 - type_2
obj_06 obj_08 obj_10 obj_09 - type_3
obj_02 obj_01 obj_04 - object)
(:init
(pred_1 obj_07 obj_06)
(pred_4 obj_07 obj_03)
(pred_4 obj_07 obj_05)
(pred_3 obj_02 obj_06)
(pred_3 obj_01 obj_08)
(pred_3 obj_04 obj_09)
)
(:goal
(and
(pred_3 obj_02 obj_09)
(pred_3 obj_01 obj_06)
(pred_3 obj_04 obj_06)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_07 ?b obj_05))))
)
)

; plan
1. (op_3 obj_07 obj_02 obj_06 obj_03)
   deleted: (pred_3 obj_02 obj_06) (pred_4 obj_07 obj_03)
   added: (pred_2 obj_07 obj_02 obj_03)
   goals met: 0 of 3
2. (op_2 obj_07 obj_06 obj_09)
   deleted: (pred_1 obj_07 obj_06)
   added: (pred_1 obj_07 obj_09)
   goals met: 0 of 3
3. (op_1 obj_07 obj_02 obj_09 obj_03)
   deleted: (pred_2 obj_07 obj_02 obj_03)
   added: (pred_3 obj_02 obj_09) (pred_4 obj_07 obj_03)
   goals met: 1 of 3
4. (op_3 obj_07 obj_04 obj_09 obj_03)
   deleted: (pred_3 obj_04 obj_09) (pred_4 obj_07 obj_03)
   added: (pred_2 obj_07 obj_04 obj_03)
   goals met: 1 of 3
5. (op_2 obj_07 obj_09 obj_06)
   deleted: (pred_1 obj_07 obj_09)
   added: (pred_1 obj_07 obj_06)
   goals met: 1 of 3
6. (op_1 obj_07 obj_04 obj_06 obj_03)
   deleted: (pred_2 obj_07 obj_04 obj_03)
   added: (pred_3 obj_04 obj_06) (pred_4 obj_07 obj_03)
   goals met: 2 of 3
7. (op_2 obj_07 obj_06 obj_08)
   deleted: (pred_1 obj_07 obj_06)
   added: (pred_1 obj_07 obj_08)
   goals met: 2 of 3
8. (op_3 obj_07 obj_01 obj_08 obj_03)
   deleted: (pred_3 obj_01 obj_08) (pred_4 obj_07 obj_03)
   added: (pred_2 obj_07 obj_01 obj_03)
   goals met: 2 of 3
9. (op_2 obj_07 obj_08 obj_06)
   deleted: (pred_1 obj_07 obj_08)
   added: (pred_1 obj_07 obj_06)
   goals met: 2 of 3
10. (op_1 obj_07 obj_01 obj_06 obj_03)
   deleted: (pred_2 obj_07 obj_01 obj_03)
   added: (pred_3 obj_01 obj_06) (pred_4 obj_07 obj_03)
   goals met: 3 of 3
